VPro/src/Catalogs/Vehicles/Vehicles.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Vehicles</name>
  <attributes>
    <name>Brand</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ImportingCapacityInTonnes</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CapacityInCubicMeters</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>VehicleType</name>
    <type>
      <types>EnumRef.VehicleKinds</types>
    </type>
  </attributes>
  <attributes>
    <name>CurrentLicenseCard</name>
    <type>
      <types>CatalogRef.VehiclesLicenseCards</types>
    </type>
  </attributes>
  <tabularSections>
    <name>AdditionalAttributes</name>
    <attributes>
      <name>Property</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.AdditionalAttributesAndInformation</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Characteristic.AdditionalAttributesAndInformation</types>
      </type>
    </attributes>
    <attributes>
      <name>TextString</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

VPro/src/Enums/VehicleKinds/VehicleKinds.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>VehicleKinds</name>
  <enumValues>
    <name>MotorVehicle</name>
  </enumValues>
  <enumValues>
    <name>TowedVehicle</name>
  </enumValues>
</mdclass:Enum>

VPro/src/Catalogs/AdditionalAttributesAndInformationSets/AdditionalAttributesAndInformationSets.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>AdditionalAttributesAndInformationSets</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Catalog_ProductsAndServices</name>
      <description>ProductsAndServices</description>
    </items>
    <items>
      <name>Catalog_Specifications</name>
      <description>Specifications</description>
    </items>
    <items>
      <name>Catalog_ProductsAndServicesCharacteristics</name>
      <description>Đặc tính mặt hàng</description>
    </items>
    <items>
      <name>Catalog_Banks</name>
      <description>Banks</description>
    </items>
    <items>
      <name>Document_ExpenseReport</name>
      <description>Авансовый отчет</description>
    </items>
    <items>
      <name>Document_AcceptanceCertificate</name>
      <description>Biên bản bàn giao công việc</description>
    </items>
    <items>
      <name>Catalog_ExternalUsers</name>
      <description>Người sử dụng ngoài</description>
    </items>
    <items>
      <name>Catalog_CounterpartyContracts</name>
      <description>Hợp đồng với đối tác</description>
    </items>
    <items>
      <name>Document_LoanContract</name>
      <description>Loan contract</description>
    </items>
    <items>
      <name>Document_LoanInterestCommissionAccruals</name>
      <description>Loan interest commission accruals</description>
    </items>
    <items>
      <name>Document_WorkOrder</name>
      <description>Giao việc</description>
    </items>
    <items>
      <name>Document_ProductionOrder</name>
      <description>Đơn hàng sản xuất</description>
    </items>
    <items>
      <name>Document_CustomerOrder</name>
      <description>Đơn hàng của khách</description>
    </items>
    <items>
      <name>Document_PurchaseOrder</name>
      <description>Đơn hàng đặt nhà cung cấp</description>
    </items>
    <items>
      <name>Document_CashOutflowPlan</name>
      <description>Giấy đề nghị thanh toán</description>
    </items>
    <items>
      <name>Catalog_FixedAssets</name>
      <description>Assets</description>
    </items>
    <items>
      <name>Catalog_ContactPersons</name>
      <description>Người liên hệ</description>
    </items>
    <items>
      <name>Catalog_Counterparties</name>
      <description>Đối tác</description>
    </items>
    <items>
      <name>Catalog_SuppliersProductsAndServices</name>
      <description>Mặt hàng nhà cung cấp</description>
    </items>
    <items>
      <name>Catalog_Companies</name>
      <description>Doanh nghiệp</description>
    </items>
    <items>
      <name>Catalog_FileFolders</name>
      <description>Thư mục tệp</description>
    </items>
    <items>
      <name>Catalog_ProductsAndServicesBatches</name>
      <description>Nhóm sản phẩm</description>
    </items>
    <items>
      <name>Document_InventoryTransfer</name>
      <description>Перемещение запасов</description>
    </items>
    <items>
      <name>Catalog_Users</name>
      <description>Người sử dụng</description>
    </items>
    <items>
      <name>Document_CashReceipt</name>
      <description>Thu tiền mặt</description>
    </items>
    <items>
      <name>Document_PaymentReceipt</name>
      <description>Thu vào tài khoản</description>
    </items>
    <items>
      <name>Document_SupplierInvoice</name>
      <description>Hóa đơn nhận hàng</description>
    </items>
    <items>
      <name>Document_GoodsReceipt</name>
      <description>Приходный ордер</description>
    </items>
    <items>
      <name>Document_InventoryAssembly</name>
      <description>Production</description>
    </items>
    <items>
      <name>Document_CashPayment</name>
      <description>Chi tiền mặt</description>
    </items>
    <items>
      <name>Document_PaymentExpense</name>
      <description>Chi từ tài khoản</description>
    </items>
    <items>
      <name>Document_CustomerInvoice</name>
      <description>Hóa đơn giao hàng</description>
    </items>
    <items>
      <name>Document_GoodsExpense</name>
      <description>Расходный ордер</description>
    </items>
    <items>
      <name>Document_JobSheet</name>
      <description>Сдельный наряд</description>
    </items>
    <items>
      <name>Document_Event</name>
      <description>Sự kiện</description>
    </items>
    <items>
      <name>Catalog_Employees</name>
      <description>Employees</description>
    </items>
    <items>
      <name>Document_InventoryWriteOff</name>
      <description>Списание запасов</description>
    </items>
    <items>
      <name>Catalog_CashFlowItems</name>
      <description>Dạng lưu chuyển tiền tệ</description>
    </items>
    <items>
      <name>Catalog_SerialNumbers</name>
      <description>Danh mục số sê-ri</description>
    </items>
    <items>
      <name>Catalog_StructuralUnits</name>
      <description>Cơ cấu tổ chức</description>
    </items>
    <items>
      <name>Document_InvoiceForPayment</name>
      <description>Hóa đơn thanh toán</description>
    </items>
    <items>
      <name>Document_SupplierInvoiceForPayment</name>
      <description>Hóa đơn thanh toán của nhà cung cấp</description>
    </items>
    <items>
      <name>Catalog_Vehicles</name>
      <description>Phương tiện vận tải</description>
    </items>
    <items>
      <name>Catalog_Files</name>
      <description>Tệp</description>
    </items>
    <items>
      <name>Catalog_Individuals</name>
      <description>Cá nhân</description>
    </items>
  </predefined>
  <attributes>
    <name>CountAttributes</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CountInformation</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Used</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>PredefinedSetName</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>AdditionalAttributes</name>
    <attributes>
      <name>Property</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.AdditionalAttributesAndInformation</types>
      </type>
    </attributes>
    <attributes>
      <name>DeletionMark</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>PredefinedSetName</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>AdditionalInformation</name>
    <attributes>
      <name>Property</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.AdditionalAttributesAndInformation</types>
      </type>
    </attributes>
    <attributes>
      <name>DeletionMark</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>PredefinedSetName</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Presentations</name>
    <attributes>
      <name>LanguageCode</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Description</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

VPro/src/Catalogs/Vehicles/Forms/ItemForm/Module.bsl
#Region ServiceProceduresAndFunctions

&AtClient
Procedure GenerateDescription()
	
	Object.Description = TrimAll(Object.Code) + " " + TrimAll(Object.Brand);
	
EndProcedure

&AtClient
Procedure SetAttributesEnabled()
	
	ThisCar = (Object.VehicleType = PredefinedValue("Enum.VehicleKinds.MotorVehicle"));
	CommonUseClientServer.SetFormItemProperty(Items, "CurrentLicenseCard", "Enabled", ThisCar);
	
EndProcedure

#EndRegion

#Region FormEventsHandlers

&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	ThisCar = (Object.VehicleType = Enums.VehicleKinds.MotorVehicle);
	CommonUseClientServer.SetFormItemProperty(Items, "CurrentLicenseCard", "Enabled", ThisCar);
	
	// StandardSubsystems.Properties
	AdditionalParameters = PropertiesManagementOverridable.FillAdditionalParameters(Object, "AdditionalAttributesGroup");
	PropertiesManagement.OnCreateAtServer(ThisObject, AdditionalParameters);
	// End StandardSubsystems.Properties
	
EndProcedure

&AtServer
Procedure OnReadAtServer(CurrentObject)
	
	// StandardSubsystems.Properties
	PropertiesManagement.OnReadAtServer(ThisObject, CurrentObject);
	// End StandardSubsystems.Properties
	
EndProcedure

&AtServer
// Procedure-handler of the BeforeWriteAtServer event.
// Performs initial attributes forms filling.
//
Procedure BeforeWriteAtServer(Cancel, CurrentObject, WriteParameters)
	
	// StandardSubsystems.Properties
	PropertiesManagement.BeforeWriteAtServer(ThisObject, CurrentObject);
	// End StandardSubsystems.Properties
	
EndProcedure // BeforeWriteAtServer()

&AtClient
Procedure NotificationProcessing(EventName, Parameter, Source)
	
	// StandardSubsystems.Properties 
	If PropertiesManagementClient.ProcessAlerts(ThisObject, EventName, Parameter) Then
		UpdateAdditionalAttributesItems();
	EndIf;
	// End StandardSubsystems.Properties
	
EndProcedure

&AtServer
Procedure FillCheckProcessingAtServer(Cancel, CheckedAttributes)
	
	// StandardSubsystems.Properties
	PropertiesManagement.FillCheckProcessing(ThisObject, Cancel, CheckedAttributes);
	// End StandardSubsystems.Properties
	
EndProcedure

#EndRegion

#Region FormItemEventsHandlers

&AtClient
Procedure CodeOnChange(Item)
	
	GenerateDescription();
	
EndProcedure

&AtClient
Procedure BrandOnChange(Item)
	
	GenerateDescription();
	
EndProcedure

&AtClient
Procedure VehicleTypeOnChange(Item)
	
	SetAttributesEnabled();
	
EndProcedure

#EndRegion

#Region FormCommandsHandlers

&AtClient
Procedure AddAdditionalAttribute(Command)
	
	FormParameters = New Structure;
	FormParameters.Insert("CurrentSetOfProperties", PredefinedValue("Catalog.AdditionalAttributesAndInformationSets.Catalog_Vehicles"));
	FormParameters.Insert("ThisIsAdditionalInformation", False);
	
	OpenForm("ChartOfCharacteristicTypes.AdditionalAttributesAndInformation.ObjectForm", FormParameters,,,,,,FormWindowOpeningMode.LockOwnerWindow);
	
EndProcedure

#EndRegion

#Region LibrariesHandlers

// StandardSubsystems.Properties
&AtServer
Procedure UpdateAdditionalAttributesItems()
	
	PropertiesManagement.UpdateAdditionalAttributesItems(ThisObject);
	
EndProcedure

&AtClient
Procedure Attachable_PropertiesRunCommand(ItemOrCommand, URL = Undefined, StandardProcessing = Undefined)
	PropertiesManagementClient.ExecuteCommand(ThisObject, ItemOrCommand, StandardProcessing);
EndProcedure

&AtClient
Procedure UpdateAdditionalAttributesDependencies()
	PropertiesManagementClient.UpdateAdditionalAttributesDependencies(ThisObject);
EndProcedure

&AtClient
Procedure Attachable_AdditionalAttributeOnChange(Item)
	PropertiesManagementClient.UpdateAdditionalAttributesDependencies(ThisObject);
EndProcedure
// End StandardSubsystems.Properties

#EndRegion
